In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

## Accessing the Dataset

In [68]:
dt = pd.read_csv (r'C:\DSA\week6\StudentsPerformance.csv') #data reading

In [20]:
dt

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33
...,...,...,...,...,...,...,...,...
995,male,group E,some college,standard,completed,99,87,81
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
998,male,group E,associate's degree,free/reduced,completed,100,100,93
999,male,group E,bachelor's degree,standard,completed,100,100,100

## 1.Number of males and females participated in the test

In [4]:
dt['gender'].value_counts()

female    518
male      482
Name: gender, dtype: int64

- There are more females in number who appeared for the test

## 2.Students' parental level of education

In [5]:
dt['parental level of education'].value_counts()

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental level of education, dtype: int64

- The maximum students attended the test comes from families with some level of college education
- master's degree is the highest level of parental education which is also the lowest in number

## 3.a Most score on average for math,reading and writing based on gender

In [46]:
avg1=dt.groupby('gender')['math score'].mean().nlargest(1) # grouping and finding the average. then the largest one is isolated
avg1

gender
male    68.821577
Name: math score, dtype: float64

In [48]:
avg2=dt.groupby('gender')['reading score'].mean().nlargest(1)
avg2

gender
female    72.590734
Name: reading score, dtype: float64

In [49]:
avg3=dt.groupby('gender')['writing score'].mean().nlargest(1)
avg3

gender
female    72.467181
Name: writing score, dtype: float64

- On an average, male category scored more in 'math score' and female category in rest of the fields.
- The average math score is comparitively lower with respect to that of reading and writing score.

## 3.b Most score on average for math, reading and writing based on test preparation course

In [51]:
avg4=dt.groupby('test preparation course')['math score'].mean().nlargest(1)
avg4

test preparation course
completed    69.96648
Name: math score, dtype: float64

In [53]:
avg5=dt.groupby('test preparation course')['reading score'].mean().nlargest(1)
avg5

test preparation course
completed    74.175978
Name: reading score, dtype: float64

In [54]:
avg6=dt.groupby('test preparation course')['writing score'].mean().nlargest(1)
avg6

test preparation course
completed    74.684358
Name: writing score, dtype: float64

- Clearly the participants who completedthe test preparation course scored well in all theree tests.

## 4.a Scoring variation for math, reading and writing based on gender

In [61]:
score1=dt.groupby('gender')['math score','reading score','writing score'].var()
score1

C:\Users\psana\AppData\Local\Temp/ipykernel_15284/1400973820.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  score1=dt.groupby('gender')['math score','reading score','writing score'].var()

        math score  reading score  writing score
gender
female  256.958593     207.677438     220.369327
male    211.889097     200.211010     202.413924

In [65]:
var1 =dt.groupby('gender')['math score','reading score','writing score'].std()
var1

C:\Users\psana\AppData\Local\Temp/ipykernel_15284/3629983233.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  var1 =dt.groupby('gender')['math score','reading score','writing score'].std()

        math score  reading score  writing score
gender
female   16.029928      14.411018      14.844842
male     14.556411      14.149594      14.227225

- Calculated both SD and variance
- A small standard deviation coefficient indicates a small degree of variability. There is no much difference when it comes to the data when compared between the two genders

## 4.b Scoring variation for math, reading and writing based on test preparation course

In [66]:
var4 =dt.groupby('test preparation course')['math score','reading score','writing score'].std()
var4

C:\Users\psana\AppData\Local\Temp/ipykernel_15284/2757117445.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  var4 =dt.groupby('test preparation course')['math score','reading score','writing score'].std()

                         math score  reading score  writing score
test preparation course
completed                 14.521847      13.537572      13.236412
none                      15.705689      14.608896      15.041667

In [67]:
score2=dt.groupby('test preparation course')['math score','reading score','writing score'].var()
score2

C:\Users\psana\AppData\Local\Temp/ipykernel_15284/2653059958.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  score2=dt.groupby('test preparation course')['math score','reading score','writing score'].var()

                         math score  reading score  writing score
test preparation course
completed                210.884027     183.265864     175.202612
none                     246.668662     213.419851     226.251739

- A small standard deviation coefficient indicates a small degree of variability. In the case of test preparedness, those who completed the course has less variability.

# Top 25% of students based on their maths score

In [34]:
ms = dt.sort_values(by='math score',ascending=False) # arranging the data wrt to the highest math scores
ms['math topers'] = pd.qcut(ms['math score'], q=4, labels=['top tier 4', 'top tier 3', 'top tier 2', 'top tier 1']) #dividing it according to 4 equal quaartiles
ms

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,math topers
999,male,group E,bachelor's degree,standard,completed,100,100,100,top tier 1
996,male,group A,some college,standard,completed,100,96,86,top tier 1
515,female,group E,some college,standard,none,100,92,97,top tier 1
517,female,group E,associate's degree,standard,none,100,100,100,top tier 1
516,female,group E,bachelor's degree,standard,none,100,100,100,top tier 1
...,...,...,...,...,...,...,...,...,...
2,female,group B,some high school,free/reduced,none,18,32,28,top tier 4
51,female,group C,some high school,free/reduced,none,13,41,51,top tier 4
3,female,group B,some college,standard,none,11,38,32,top tier 4
1,female,group B,high school,free/reduced,none,8,24,23,top tier 4
0,female,group C,some high school,free/reduced,none,0,17,10,top tier 4

- Check the new math toppers column to identify the toppers. the top 25% are identified as top tier 1

In [8]:
dt.sort_values(by='math score',ascending=False).head(250)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
999,male,group E,bachelor's degree,standard,completed,100,100,100
996,male,group A,some college,standard,completed,100,96,86
515,female,group E,some college,standard,none,100,92,97
517,female,group E,associate's degree,standard,none,100,100,100
516,female,group E,bachelor's degree,standard,none,100,100,100
...,...,...,...,...,...,...,...,...
856,male,group E,some high school,standard,completed,77,76,77
855,male,group E,associate's degree,free/reduced,completed,77,69,68
854,male,group D,some high school,standard,completed,77,68,69
853,male,group D,associate's degree,free/reduced,none,77,78,73
852,male,group D,some college,free/reduced,none,77,62,64

- Just isolating the top 25% using simple sorting method because i could not isolate the 250 rows in 'qcut' method!!